using System;
namespace ConsoleApp2
{
    internal class Program
    {
        static public Random random = new Random();
        static string[,] map = new string[11, 11];
        public static bool escape = false;
        static int turn;
        static int mHp = 50;
        static int mxDamage = 10;
        static int exp;
        static void Main(string[] args)
        {
            //Map();
            Player p = new Player();
            int mx = random.Next(0, 10);
            int my = random.Next(0, 10);
        Restart:
            while (!escape)
            {
                Console.Clear();
                if (map[p.x, p.y] == "X ")
                {
                    p.x = random.Next(0, 10);
                    p.y = random.Next(0, 10);
                    goto Restart;
                }
                MapPrint(ref map2, ref p.hp);
                Player.Move(ref map2, ref p.x, ref p.y, ref p.hp);
                turn++;
                if (p.hp <= p.maxHp - p.regen)
                    p.hp += p.regen;
                else if (p.hp >= p.maxHp - p.regen && p.hp < p.maxHp)
                    p.hp = p.maxHp;
                if (turn % 5 == 0 && map2[mx, my] != "M ")
                {
                    Mspawn:
                    mx = random.Next(0, 10);
                    my = random.Next(0, 10);
                    if (map2[mx, my] != "X ")
                        map2[mx, my] = "M ";
                    else
                        goto Mspawn;
                }// спавн монстра, если на крате монстров меньше одного + запрет спавна на месте стены
                if (mx == p.x && my == p.y && (mHp > 0 || p.hp > 0))
                {
                    while (mHp > 0 && p.hp > 0)
                    {
                        if (p.hp > 0)
                        {
                            mHp -= p.damage;
                            if (mHp > 0)
                            {
                                p.hp -= mxDamage;
                            }
                        }
                    }
                    mHp = 100;
                    exp += 10;
                }// авто бой с монстром + реген хп до макс после смерти (ПЕРЕПИСАТЬ НООРМАЛЬНО!)
            }
        }


        static void MapPrint(ref string[,] map, ref int hp)
        {
            //Console.Clear();
            for (int i = 0; i < 11; i++)
            {
                Console.WriteLine();
                for (int j = 0; j < 11; j++)
                {
                    Console.Write(map[i, j]);
                }
            }
            Console.WriteLine($"\nХод: {turn}\n\nЗдоровье: {hp}\nОпыт: {exp}\n");
        }
        /*static void Map()
        {
            for (int i = 0; i < 11; i++)
            {
                Console.WriteLine();
                for (int j = 0; j < 11; j++)
                {
                    map[i, j] = ". ";
                }
            }
        }*/

        public static string[,] map2 = {
{". ",". ",". ",". ",". ",". ","X ",". ",". ",". ",". "},
{". ","X ","X ","X ","X ",". ","X ",". ","X ","X ","X "},
{". ",". ",". ",". ",". ",". ","X ",". ","X ",". ",". "},
{"X ","X ",". ","X ","X ",". ","X ",". ","X ",". ","X "},
{". ","X ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{". ","X ","X ","X ","X ",". ","X ",". ","X ","X ","X "},
{". ","X ",". ",". ",". ",". ","X ",". ",". ",". ","X "},
{". ","X ",". ",". ",". ",". ","X ",". ","X ",". ","X "},
{". ",". ",". ",". ",". ",". ","X ",". ","X ",". ","X "},
{". ","X ","X ","X ","X ","X ","X ",". ","X ",". ","X "},
{". ","X ",". ",". ",". ",". ",". ",". ","X ",". ",". "},};
        static string[,] map3 = {
{"X ","X ","X ",". ","X ",". ",". ",". ",". ",". ",". "},
{". ",". ",". ",". ","X ",". ","X ","X ","X ","X ",". "},
{". ","X ","X ","X ","X ",". ","X ",". ",". ","X ",". "},
{". ","X ",". ",". ",". ",". ",". ",". ",". ","X ",". "},
{". ","X ",". ","X ","X ","X ","X ","X ","X ","X ",". "},
{". ",". ",". ",". ",". ","X ",". ",". ",". ",". ",". "},
{". ","X ",". ","X ",". ","X ",". ","X ","X ","X ","X "},
{". ","X ",". ","X ",". ","X ",". ","X ",". ",". ","X "},
{". ","X ",". ","X ",". ","X ",". ","X ",". ",". ","X "},
{". ","X ","X ","X ",". ","X ",". ","X ","X ",". ","X "},
{". ",". ",". ",". ",". ",". ",". ",". ",". ",". ",". "},};
        static string[,] map4 = {
{"X ","X ","X ","X ","X ","X ","X ","X ","X ","X ","X "},
{"X ",". ",". ","X ","X ","X ","X ","X ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ","X ",". ","X ","X ",". ","X ","X ",". ","X ","X "},
{"X ","X ",". ","X ",". ",". ",". ","X ",". ","X ","X "},
{"X ","X ",". ",". ",". ",". ",". ",". ",". ","X ","X "},
{"X ","X ",". ","X ",". ",". ",". ","X ",". ","X ","X "},
{"X ","X ",". ","X ","X ",". ","X ","X ",". ","X ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ","X ","X ","X ","X ","X ",". ",". ","X "},
{"X ","X ","X ","X ","X ","X ","X ","X ","X ","X ","X "},};
        static string[,] map5 = {
{"X ","X ","X ","X ","X ",". ","X ","X ","X ","X ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ","B ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ",". ",". ",". ",". ",". ",". ",". ",". ",". ","X "},
{"X ","X ","X ","X ","X ",". ","X ","X ","X ","X ","X "},};
    }
}
/*
1) добавить карты (штук 5 в ручную сделать) +
2) сделать точку перехода на след карту(как варинт сделать массив со всеми картами сразу)
3) При переходе на карту сделать монстров по дефолту сильнее
4) сделать систему уровней, мб прокачку в виде талантов
5) Добавить инвентарь
6) Разбросать сундуки с предметами по карте
7) добавить дроп с врагов с низким процентом
8) Сделать подсчет итогового счета
*/
